# specify a directory to install
cask_args appdir: '/Applications'

# install packages
brew 'aom'
brew 'assimp'
brew 'autoconf'
brew 'bat'
brew 'bdw-gc'
brew 'blueutil'
brew 'brotli'
brew 'ca-certificates'
brew 'cairo'
brew 'cfitsio'
brew 'dbus'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'double-conversion'
brew 'fftw'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'gcc'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'ghostscript'
brew 'giflib'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnutls'
brew 'gobject-introspection'
brew 'graphite2'
brew 'guile'
brew 'harfbuzz'
brew 'hdf5'
brew 'hunspell'
brew 'hwloc'
brew 'icu4c'
brew 'imagemagick'
brew 'imath'
brew 'isl'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg'
brew 'jpeg-xl'
brew 'krb5'
brew 'libassuan'
brew 'libb2'
brew 'libde265'
brew 'libevent'
brew 'libexif'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libgsf'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'libimagequant'
brew 'libksba'
brew 'liblqr'
brew 'libmatio'
brew 'libmpc'
brew 'libnghttp2'
brew 'libomp'
brew 'libpng'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libspng'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'little-cms2'
brew 'luajit-openresty'
brew 'luv'
brew 'lzo'
brew 'm4'
brew 'md4c'
brew 'mozjpeg'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'ncurses'
brew 'neovim'
brew 'nettle'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'open-mpi'
brew 'openexr'
brew 'openjpeg'
brew 'openslide'
brew 'openssl@1.1'
brew 'orc'
brew 'p11-kit'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'postgresql'
brew 'python@3.9'
brew 'qt'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'ruby-build'
brew 'shared-mime-info'
brew 'sqlite'
brew 'szip'
brew 'tmux'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vips'
brew 'webp'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xz'
brew 'zstd'
tap 'heroku/brew'
brew 'heroku'
brew 'qemu'
brew 'lima'
brew 'htop'
brew 'aria2'
brew 'mosh'
brew 'youtube-dl'
brew 'docker-compose'
brew 'speedtest-cli'

# Casks
cask '1password'
cask 'alfred'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'karabiner-elements'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'tunnelblick'
cask 'notion'
cask 'discord'
cask 'soda-player'
cask 'iina'
cask 'homebrew/cask-versions/firefox-developer-edition'

# fonts
tap'homebrew/cask-fonts'
cask 'font-anonymous-pro'
